Repository: NaN-tic/trytond-file_format
Catalog: locale/*.po
Languages: ca, es

# error:file.format:
source: The Path "%(path)s" of File Format "%(file_format)s" doesn't exists.
es: La ruta "%(path)s" del Formato de fichero "%(file_format)s" no existe.

# error:file.format:
source: The Tryton server user doesn't have enough permissions over the Path "%(path)s" of File Format "%(file_format)s". Please, contact with your server administrator.
es: El servidor de tryton no tiene suficiente permisos para acceder a la ruta "%(path)s" del formato de fichero "%(file_format)s". Por favor, pongase en contacto con el administrador del sistema.

# field:file.format,create_date:
source: Create Date
ca: Data de creació
es: Fecha de creación

# field:file.format,create_uid:
source: Create User
ca: Usuari de creació
es: Usuario de creación

# field:file.format,fields:
source: Fields
ca: Camps
es: Campos

# field:file.format,file_name:
source: File Name
ca: Nom del fitxer
es: Nombre del fichero

# field:file.format,header:
source: Header
ca: Capçalera
es: Cabecera

# field:file.format,id:
source: ID
es: Identificador

# field:file.format,model:
source: Model
es: Modelo

# field:file.format,name:
source: Name
ca: Nom
es: Nombre

# field:file.format,path:
source: Path
ca: Ruta
es: Ruta

# field:file.format,quote:
source: Quote
ca: Cometes
es: Presupuesto

# field:file.format,rec_name:
source: Name
ca: Nom
es: Nombre

# field:file.format,separator:
source: Separator
ca: Separador
es: Separador

# field:file.format,write_date:
source: Write Date
ca: Data modificació
es: Fecha modificación

# field:file.format,write_uid:
source: Write User
ca: Usuari modificació
es: Usuario modificación

# field:file.format.field,align:
source: Align
ca: Alineació
es: Alineación

# field:file.format.field,create_date:
source: Create Date
ca: Data de creació
es: Fecha de creación

# field:file.format.field,create_uid:
source: Create User
ca: Usuari de creació
es: Usuario de creación

# field:file.format.field,decimal_character:
source: Decimal Character
ca: Caràcter decimals
es: Separador decimales

# field:file.format.field,expression:
source: Expression
ca: Expressió
es: Expressión

# field:file.format.field,fill_character:
source: Fill Char
ca: Caràcter emplenat
es: Carácter relleno

# field:file.format.field,format:
source: Format
es: Formato

# field:file.format.field,id:
source: ID
es: Identificador

# field:file.format.field,length:
source: Length
ca: Longitud
es: Longitud

# field:file.format.field,name:
source: Name
ca: Nom
es: Nombre

# field:file.format.field,number_format:
source: Number Format
ca: Format nombres
es: Formato numerico

# field:file.format.field,rec_name:
source: Name
ca: Nom
es: Nombre

# field:file.format.field,sequence:
source: Sequence
ca: Seqüència
es: Secuencia

# field:file.format.field,write_date:
source: Write Date
ca: Data modificació
es: Fecha modificación

# field:file.format.field,write_uid:
source: Write User
ca: Usuari modificació
es: Usuario modificación

# help:file.format,header:
source: Header (fields name) on files.
ca: Capçalera (nom dels camps) als fitxers.
es: Cabecera (nombre de los campos) en los ficheros

# help:file.format,path:
source: The path to the file name. The last slash is not necessary.
ca: La ruta cap al fitxer. L'última barra no és necessària.
es: La ruta hasta el fichero. La última barra no es necessaria.

# help:file.format,quote:
source: Character to use as quote.
ca: Caràcter a utilitzar com a cometes
es: Carácter a utilizar para citar.

# help:file.format,separator:
source: Put here, if it's necessary, the separator between each field.
ca: Posi aquí, si es necessari, el caracter a utilitzar com a separador entre cada camp.
es: Introducir separador entre campos si se necessita.

# help:file.format.field,align:
source: If you set a specific length, you can decid the alignment of the value.
ca: Si defineix una mida específica, pot decidir l'alineació del valor.
es: Si establece una longitud específica puede elegir la alineación que quiere para el valor.

# help:file.format.field,decimal_character:
source: If you need and specific decimal character for the float fields
ca: Si necessita un caràcter específic pels valor amb decimals.
es: Si se necessita un carácter especial para el separador de decimales de los campos numéricos

# help:file.format.field,expression:
source: Python code for field processing. The fields are called like "$field_name" (without quotes).
ca: Codi Python pel processat del camp. Els camps són cridats com "$nom_del_camp" (sense les cometes).
es: Código Python para processar el cmapo. Los campos se llaman "$field_name" (sin comillas)

# help:file.format.field,fill_character:
source: If you set a specific length, this character will be used to fill the field until the specified length.
ca: Sio especifica una llargada específica, aquest caràcter s'utilitzarà per omplir el camp fins completar-lo.
es: Si establece una longitud específica, se utilizará este carácter para rellenar el campo hasta la longitud especificada

# help:file.format.field,length:
source: Set 0 if there isn't any required length for the field.
ca: Posi un 0 si no es requereix una mida concreta pel camp.
es: Utilizar 0 si no existe longitud específica para el campo

# help:file.format.field,name:
source: The name of the field. It's used if you have selected the Header checkbox.
ca: El nom del camp. S'utilitza si ha escollit l'opció "Capçalera".
es: El nombre del campo. Se utiliza si ha seleccionado la opción "Cabecera".

# help:file.format.field,number_format:
source: Expression to format as string an integer or float field. E.g: if you have a float and want 2 decimals, write here "%.2f" (without quotes).
ca: Expressió per donar format com a text un camp enter o decimal. P.e: si mostrar dos decimals, escrigui aquí "%.2f" (sense les cometes).
es: Expresión para formatear cómo cadena de carácteres un campo numèrico. P.g: Si tienes un número decimal y se quieren 2 decimales, escribe aquí "%.2f" (sin comillas)

# help:file.format.field,sequence:
source: The order that you want for the field's column in the file.
ca: L'ordre que voldrà per la columna d'aquest camp al fitxer.
es: El orden en que se quiere las columnas de los campos en los ficheros

# model:file.format,name:
source: File Format
ca: Format fitxer
es: Formato fichero

# model:file.format.field,name:
source: File Format Field
ca: Camp format fitxer
es: Campo de formato de fichero

# model:ir.action,name:act_file_format
source: File Format
ca: Format fitxer
es: Formato fichero

# model:ir.action,name:act_file_format_field
source: File Format Field
ca: Camp format fitxer
es: Campo de formato de fichero

# model:ir.ui.menu,name:menu_file_format
source: File Format
ca: Format fitxer
es: Formato fichero

# model:ir.ui.menu,name:menu_file_format_root
source: File Format
ca: Format fitxer
es: Formato fichero

# model:res.group,name:group_file_format_admin
source: File Format Configuration
ca: Configuració format fitxer
es: Configuración formato de fichero

# selection:file.format.field,align:
source: Left
ca: Esquerra
es: Izquierda

# selection:file.format.field,align:
source: Right
ca: Dreta
es: Derecha

# view:file.format.field:
source: File Format Field
ca: Camp format fitxer
es: Campo de formato de fichero

# view:file.format:
source: File Format
ca: Format fitxer
es: Formato fichero

# model:ir.message,text:msg_path_not_exists
source: The Path "%(path)s" of File Format "%(file_format)s" doesn't exists.
ca: La ruta "%(path)s" pel format de fitxer "%(file_format)s" no existeix.

# model:ir.message,text:msg_path_no_permission
source: The Tryton server user doesn't have enough permissions over the Path "%(path)s" of File Format "%(file_format)s". Please, contact with your server administrator.
ca: L'usuari del servidor Tryton no té permisos suficient sobre el directori "%(path)s" utilitzat pel format de fitxers "%(file_format)s". Si us plau, contacti amb l'administrador del servidor.
